---

## üß™ Lab 7 ‚Äì Inter-VLAN Routing with Trunk Links

### üñ•Ô∏è Topology

* **2 Switches**
* **4 PCs**
* **1 Router (R1)**

---

### ‚úÖ Objective

1. Test initial connectivity between PCs.
2. Assign VLANs to PCs.
3. Create a trunk link between switches.
4. Configure inter-VLAN routing using subinterfaces on R1.
5. Verify communication between PCs in different VLANs.

---

### üß© Step-by-Step Instructions

#### 1Ô∏è‚É£ Initial Ping Test

* Ping between the PCs before configuration.
* Only PCs on the same switch and same default VLAN may succeed in pinging each other.

---

#### 2Ô∏è‚É£ Assign VLANs to PCs

**üîß Switch 1 (SW1):**

```bash
Switch> enable
Switch# configure terminal
Switch(config)# interface f0/1
Switch(config-if)# switchport mode access
Switch(config-if)# switchport access vlan 13

Switch(config)# interface f0/2
Switch(config-if)# switchport mode access
Switch(config-if)# switchport access vlan 24
```

**üîß Switch 2 (SW2):**

```bash
Switch> enable
Switch# configure terminal
Switch(config)# interface f0/1
Switch(config-if)# switchport mode access
Switch(config-if)# switchport access vlan 13

Switch(config)# interface f0/2
Switch(config-if)# switchport mode access
Switch(config-if)# switchport access vlan 24
```

---

#### 3Ô∏è‚É£ Create a Trunk Link Between Switches

Before trunking, pinging between PCs on different switches will fail.

**On SW1:**

```bash
Switch(config)# interface g0/2
Switch(config-if)# switchport mode trunk
```

**On SW2:**

```bash
Switch(config)# interface g0/1
Switch(config-if)# switchport mode trunk
```

Now, **ping between PC1 and PC3** should succeed.
**Ping between PC1 and PC4** will still fail because routing is not configured yet.

---

#### 4Ô∏è‚É£ Configure Inter-VLAN Routing on R1

Enable the router interface:

```bash
Router> enable
Router# configure terminal
Router(config)# interface g0/0
Router(config-if)# no shutdown
```

Create subinterfaces:

```bash
Router(config)# interface g0/0.13
Router(config-subif)# encapsulation dot1Q 13
Router(config-subif)# ip address 10.0.0.1 255.255.255.128

Router(config)# interface g0/0.24
Router(config-subif)# encapsulation dot1Q 24
Router(config-subif)# ip address 10.0.0.129 255.255.255.128
```

Now configure **SW1‚Äôs interface connected to the router as a trunk**:

```bash
Switch(config)# interface g0/1
Switch(config-if)# switchport mode trunk
```

---

#### 5Ô∏è‚É£ Final Ping Test

After completing the above steps:

* ‚úÖ **PC1 ‚Üî PC3** (VLAN 13): should succeed
* ‚úÖ **PC2 ‚Üî PC4** (VLAN 24): should succeed
* ‚úÖ Inter-VLAN communication through the router is now active

---

### üìÇ Files Included

* `lab7.pkt` ‚Äì Packet Tracer file
* `README.md` ‚Äì This documentation

this lab from [Jeremy's IT Lab]
 
---
